const obj ={
  code: 0,
  message: 'ok',
  data: {
    pic:"https://p1.music.126.net/v1b40UUT8wO0Ebihuz3ZNw==/109951168689166316.jpg?imageView&thumbnail=360y360&quality=75&tostatic=0",
    duration: '03:04',
    Wording:"作词 : 小明bro/OneOne",
    music:"作曲 : 小明bro/OneOne",
    audio:"https://m801.music.126.net/20230622202503/c90ccd8cead5299a9635c7ae0a335ea8/jdyyaac/obj/w5rDlsOJwrLDjj7CmsOj/28873490430/55cb/e1cc/a754/6a6b15b40998872a36035d84af1319d3.m4a",
    title: "月光下（她是个成熟的girl） - OneOne/小明bro",
    lyric: "[00:00.00] 作词 : 小明bro/OneOne\n[00:01.00] 作曲 : 小明bro/OneOne\n[00:02.00] 编曲 : sk8miles\n[00:19.24]出品：网易飓风X网易音乐人\n[00:29.96]告别我\n[00:32.90]无尽的空虚\n[00:36.60]在浪费的时候里\n[00:40.24]我们神游在天际\n[00:43.74]解开月球背面的秘密\n[00:46.64]月に連れて行きたい x4\n[01:01.85]（我带你看过最美丽的风景）\n[01:07.22]（我带你走过最隐秘的梦境）\n[01:11.02]（我们是最完美神秘的机遇）\n[01:14.80]（我想要带你去 去探寻）\n[01:17.72]月に連れて行きたい x4\n[01:32.16]她是个成熟的girl\n[01:33.80]兼职在club\n[01:34.50]想见她我得等三点以后\n[01:36.00]于是我背上书包\n[01:37.00]在太阳下落\n[01:38.00]的空隙中钻进\n[01:39.30]你模糊的梦\n[01:40.59]在梦里有缤纷的色彩\n[01:42.11]有斑驳的树影\n[01:42.92]有青春的倒带\n[01:43.98]我频繁的出现是因为\n[01:45.16]我想和你靠近点\n[01:46.44]背对背等月光到来\n[01:48.15]等月光落在我左手\n[01:49.82]透过我身体\n[01:50.88]从肩膀上溅起\n[01:51.75]再落进我眼底\n[01:52.47]我把树叶捡起\n[01:53.44]它就算是凋零\n[01:54.53]也没人能比过它\n[01:55.59]在我的眼里\n[01:56.43]我的爱在受雨淋\n[01:57.68]像夏虫在语冰\n[01:58.97]像烧完的余烬\n[01:59.87]照月光映你心\n[02:01.00]你心如我心\n[02:01.87]愿月光伴你\n[02:02.67]我爱你的深沉\n[02:03.68]月に連れて行きたい x4\n[02:20.37]（我带你看过最美丽的风景）\n[02:24.57]（我带你走过最隐秘的梦境）\n[02:28.35]（我们是最完美神秘的机遇）\n[02:32.13]（我想要带你去 去探寻）\n[02:34.94]月に連れて行きたい x4\n[02:50.52]和声编写：小明bro/kopoo/OneOne\n[02:51.59]录音工程师：kopoo\n[02:52.78]混音/母带：kopoo\n[02:54.20]midi：林声音乐@林海\n[02:55.40]吉他：小乐\n[02:56.51]企划：喾逸KUYI\n[02:57.72]项目统筹：喾逸KUYI/秋葵/其乐\n[02:59.08]艺人统筹：喾逸KUYI\n[03:00.15]监制：kopoo/徐思灵\n[03:01.32]音乐宣推 : 网易飓风\n[03:02.52]出品人 : 谢奇笛/唐晶晶\n[03:04]联合出品: 聚才众音\n"
  },

}
const API = {
  queryLyric() {
      return new Promise(resolve => {
          setTimeout(
              () => {
                  resolve(obj)
              },
              Math.round(Math.random() * (2000 - 500) + 500)
          )
      })
  }
}